app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','NC-17','PG','PG-13','R')) ORDER BY release_date
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(params[:movie])